{
  "table": {
    "caption": "Table 218 – Entries in the interactive form dictionary",
    "head": [
      "Key",
      "Type",
      "Value"
    ],
    "rows": [
      [
        "Fields",
        "array",
        "(Required) An array of references to the document’s root fields(those with no ancestors in the field hierarchy)."
      ],
      [
        "NeedAppearances",
        "boolean",
        "(Optional) A flag specifying whether to construct appearance streams and appearance dictionaries for all widget annotations in the document (see 12.7.3.3, “Variable Text”). Default value: false."
      ],
      [
        "SigFlags",
        "integer",
        "(Optional; PDF 1.3) A set of flags specifying various document-level characteristics related to signature fields (see Table 219 , and 12.7.4.5, “Signature Fields”). Default value: 0."
      ],
      [
        "CO",
        "array",
        "(Required if any fields in the document have additional-actions dictionaries containing a C entry; PDF 1.3) An array of indirect references to field dictionaries with calculation actions, defining the calculation order in which their values will be recalculated when the value of any field changes (see 12.6.3, “Trigger Events”)."
      ],
      [
        "DR",
        "dictionary",
        "(Optional) A resource dictionary (see 7.8.3, “Resource Dictionaries”) containing default resources (such as fonts, patterns, or colour spaces) that is used by form field appearance streams. At a minimum, this dictionary shall contain a Font entry specifying the resource name and font dictionary of the default font for displaying text."
      ],
      [
        "DA",
        "string",
        "(Optional) A document-wide default value for the DA attribute of variable text fields (see 12.7.3.3, “Variable Text”)."
      ],
      [
        "Q",
        "integer",
        "(Optional) A document-wide default value for the Q attribute of variable text fields (see 12.7.3.3, “Variable Text”)."
      ],
      [
        "XFA",
        "stream or array",
        "(Optional; PDF 1.5) A stream or array containing an XFA resource, whose format is described by the Data Package (XDP) Specification. (see the Bibliography).\nThe value of this entry is either a stream representing the entire contents of the XML Data Package or an array of text string and stream pairs representing the individual packets comprising the XML Data Package.\nSee\n12.7.8, “XFA Forms,”\nfor more information."
      ]
    ]
  }
}
