{
  "table": {
    "caption": "Table 296 – Entries in a movie activation dictionary",
    "head": [
      "Key",
      "Type",
      "Value"
    ],
    "rows": [
      [
        "Start",
        "(various)",
        "(Optional) The starting time of the movie segment to be played. Movie time values is expressed in units of time based on a time scale, which defines the number of units per second. The default time scale is defined in the movie data. The starting time is nominally a non-negative 64-bit integer, specified as follows:\n• If it is representable as an integer (subject to the implementation limit for integers, as described in Annex C), it is specified as such.\n• If it is not representable as an integer, it is specified as an 8-byte string representing a 64-bit twos-complement integer, most significant byte first.\n• If it is expressed in a time scale different from that of the movie itself, it is represented as an array of two values: an integer or byte string denoting the starting time, followed by an integer specifying the time scale in units per second.\nIf this entry is omitted, the movie is played from the beginning."
      ],
      [
        "Duration",
        "(various)",
        "(Optional) The duration of the movie segment to be played, that is specified in the same form as Start. If this entry is omitted, the movie is played to the end."
      ],
      [
        "Rate",
        "number",
        "(Optional) The initial speed at which to play the movie. If the value of this entry is negative, the movie is played backward with respect to Start and Duration. Default value: 1.0."
      ],
      [
        "Volume",
        "number",
        "(Optional) The initial sound volume at which to play the movie, in the range −1.0 to 1.0. Higher values shall denote greater volume; negative values shall mute the sound. Default value: 1.0."
      ],
      [
        "ShowControls",
        "boolean",
        "(Optional) A flag specifying whether to display a movie controller bar while playing the movie. Default value: false."
      ],
      [
        "Mode",
        "name",
        "(Optional) The play mode for playing the movie:\nOnce Play once and stop.\nOpen Play and leave the movie controller bar open.\nRepeat Play repeatedly from beginning to end until stopped.\nPalindrome Play continuously forward and backward until stopped.\nDefault value: Once."
      ],
      [
        "Synchronous",
        "boolean",
        "(Optional) A flag specifying whether to play the movie synchronously or asynchronously. If this value is true, the movie player shall retain control until the movie is completed or dismissed by the user. If the value is false, the player shall return control to the conforming reader immediately after starting the movie. Default value: false."
      ],
      [
        "FWScale",
        "array",
        "(Optional) The magnification (zoom) factor at which the movie is played. The presence of this entry implies that the movie is played in a floating window. If the entry is absent, the movie is played in the annotation rectangle.\nThe value of the entry is an array of two positive integers, [ numerator denominator ], denoting a rational magnification factor for the movie. The final window size, in pixels, is\n(numerator ÷ denominator) × Aspect\nwhere the value of Aspect is taken from the movie dictionary (see Table 295)."
      ],
      [
        "FWPosition",
        "array",
        "(Optional) For floating play windows, the relative position of the window on the screen. The value is an array of two numbers\n[ horiz vert ]\neach in the range 0.0 to 1.0, denoting the relative horizontal and vertical position of the movie window with respect to the screen.\nEXAMPLE The value [ 0.5 0.5 ] centers the window on the screen.\nDefault value: [ 0.5 0.5 ]."
      ]
    ]
  }
}
