{
  "table": {
    "caption": "Table 369 – Entries in a version 1.3 OPI dictionary",
    "head": [
      "Key",
      "Type",
      "OPI Comment",
      "Value"
    ],
    "rows": [
      [
        "Type",
        "name",
        "",
        "(Optional) The type of PDF object that this dictionary describes; if present, is OPIfor an OPI dictionary."
      ],
      [
        "Version",
        "number",
        "",
        "(Required) The version of OPI to which this dictionary refers; is the number 1.3 (not the name 1.3, as in an OPI version dictionary)."
      ],
      [
        "F",
        "file specification",
        "%ALDImageFilename",
        "(Required) The external file containing the image corresponding to this proxy."
      ],
      [
        "ID",
        "byte string",
        "%ALDImageID",
        "(Optional) An identifying string denoting the image."
      ],
      [
        "Comments",
        "text string",
        "%ALDObjectComments",
        "(Optional) A human-readable comment, typically containing instructions or suggestions to the operator of the OPI server on how to handle the image."
      ],
      [
        "Size",
        "array",
        "%ALDImageDimensions",
        "(Required) An array of two integers of the form\n[ pixelsWide pixelsHigh ]\nspecifying the dimensions of the image in pixels."
      ],
      [
        "CropRect",
        "rectangle",
        "%ALDImageCropRect",
        "(Required) An array of four integers of the form\n[ left top right bottom ]\nspecifying the portion of the image to be used."
      ],
      [
        "CropFixed",
        "array",
        "%ALDImageCropFixed",
        "(Optional) An array with the same form and meaning as CropRect, but expressed in real numbers instead of integers. Default value: the value of CropRect."
      ],
      [
        "Position",
        "array",
        "%ALDImagePosition",
        "(Required) An array of eight numbers of the form\n[ ll x ll y ul x ul y ur x ur y lr x lr y ]\nspecifying the location on the page of the cropped image, where (ll x , ll y) are the user space coordinates of the lower-left corner, (ul x , ul y) are those of the upper-left corner, (ur x , ur y) are those of the upper-right corner, and (lr x , lr y) are those of the lower-right corner. The specified coordinates shall define a parallelogram; that is, they shall satisfy the conditions\nul x ll x ur x lr x\nand\nul y ll y ur y lr y\nThe combination of Position and CropRectdetermines the image’s scaling, rotation, reflection, and skew."
      ],
      [
        "Resolution",
        "array",
        "%ALDImageResolution",
        "(Optional) An array of two numbers of the form\n[ horizRes vertRes ]\nspecifying the resolution of the image in samples per inch."
      ],
      [
        "ColorType",
        "name",
        "%ALDImageColorType",
        "(Optional) The type of colour specified by the Color entry. Valid values are Process, Spot, and Separation. Default value: Spot."
      ],
      [
        "Color",
        "array",
        "%ALDImageColor",
        "(Optional) An array of four numbers and a byte string of the form\n[ C M Y K colorName ]\nspecifying the value and name of the colour in which the image is to be rendered. The values of C, M, Y, and K shall all be in the range 0.0 to 1.0. Default value: [ 0.0 0.0 0.0 1.0 (Black)]."
      ],
      [
        "Tint",
        "number",
        "%ALDImageTint",
        "(Optional) A number in the range 0.0 to 1.0 specifying the concentration of the colour specified by Color in which the image is to be rendered. Default value: 1.0."
      ],
      [
        "Overprint",
        "boolean",
        "%ALDImageOverprint",
        "(Optional) A flag specifying whether the image is to overprint (true) or knock out (false) underlying marks on other separations. Default value: false."
      ],
      [
        "ImageType",
        "array",
        "%ALDImageType",
        "(Optional) An array of two integers of the form\n[ samples bits ]\nspecifying the number of samples per pixel and bits per sample in the image."
      ],
      [
        "GrayMap",
        "array",
        "%ALDImageGrayMap",
        "(Optional) An array of 2n integers in the range 0 to 65,535 (where n is the number of bits per sample) recording changes made to the brightness or contrast of the image."
      ],
      [
        "Transparency",
        "boolean",
        "%ALDImageTransparency",
        "(Optional) A flag specifying whether white pixels in the image is treated as transparent. Default value: true."
      ],
      [
        "Tags",
        "array",
        "%ALDImageAsciiTag< NNN >",
        "(Optional) An array of pairs of the form\n[ tagNum1 tagText1 … tagNumn tagTextn ]\nwhere each tagNum is an integer representing a TIFF tag number and each tagText is an ASCII string representing the corresponding ASCII tag value."
      ]
    ]
  }
}
