{
  "table": {
    "caption": "Table 307 – Entries in a render mode dictionary",
    "head": [
      "Key",
      "Type",
      "Value"
    ],
    "rows": [
      [
        "Type",
        "name",
        "(Optional) The type of PDF object that this dictionary describes; if present, is 3DRenderMode."
      ],
      [
        "Subtype",
        "name",
        "(Required) The type of render mode described by this dictionary; see\nTable 308\nfor specific values. If an unrecognized value is encountered, then this render mode dictionary is ignored."
      ],
      [
        "AC",
        "array",
        "(Optional) An array that specifies the auxiliary colour that is used when rendering the 3D image. The first entry in the array is a colour space; the subsequent entries is values specifying colour values in that colour space. The interpretation of this entry depends on the render mode specified by the Subtype entry, but it is often used to specify a colour for drawing points or edges.\nThe only valid colour space is DeviceRGB. If a colour space other than DeviceRGB is specified, this entry is ignored and the default value is used.\nDefault value: [/DeviceRGB 0 0 0] representing the colour black."
      ],
      [
        "FC",
        "name or array",
        "(Optional) A name or array that specifies the face color to be used when rendering the 3D image. This entry is relevant only when Subtype has a value of Illustration.\nIf the value of FC is an array, the first entry in the array is a colour space and the subsequent entries is values specifying values in that colour space. The only valid colour space is DeviceRGB. Any colour space other than DeviceRGB is ignored and the default value is used.\nIf the value of FC is a name, it shall describe a colour. The only valid name value shall BG, specifying the current background colour in use for displaying the artwork. If a name other than BG is encountered, this entry is ignored and the background colour for the host annotation is used (see Table 189).\nDefault value: BG"
      ],
      [
        "O",
        "number",
        "(Optional) A number specifying the opacity of the added transparency applied by some render modes, using a standard additive blend.\nDefault value: 0.5"
      ],
      [
        "CV",
        "number",
        "(Optional) A number specifying the angle, in degrees, that is used as the crease value when determining silhouette edges. If two front-facing faces share an edge and the angle between the normals of those faces is greater than or equal to the crease value, then that shared edge is considered a silhouette edge.\nDefault value: 45"
      ]
    ]
  }
}
