{
  "table": {
    "caption": "Table 78 – Entries Common to All Shading Dictionaries",
    "head": [
      "Key",
      "Type",
      "Value"
    ],
    "rows": [
      [
        "ShadingType",
        "integer",
        "(Required) The shading type:\n1 Function-based shading\n2 Axial shading\n3 Radial shading\n4 Free-form Gouraud-shaded triangle mesh\n5 Lattice-form Gouraud-shaded triangle mesh\n6 Coons patch mesh\n7 Tensor-product patch mesh"
      ],
      [
        "ColorSpace",
        "name or array",
        "(Required) The colour space in which colour values shall beexpressed. This may be any device, CIE-based, or special colour space except a Pattern space. See\n8.7.4.4, \"Colour Space: Special Considerations\"\nfor further information."
      ],
      [
        "Background",
        "array",
        "(Optional) An array of colour components appropriate to the colour space, specifying a single background colour value. If present, this colour is used, before any painting operation involving the shading, to fill those portions of the area to be painted that lie outside the bounds of the shading object.\nNOTE In the opaque imaging model, the effect is as if the painting operation were performed twice: first with the background colour and then with the shading.\nNOTE The background colour is applied only when the shading is used as part of a shading pattern, not when it is painted directly with the sh operator."
      ],
      [
        "BBox",
        "rectangle",
        "(Optional) An array of four numbers giving the left, bottom, right, and top coordinates, respectively, of the shading’s bounding box. The coordinates is interpreted in the shading’s target coordinate space. If present, this bounding box is applied as a temporary clipping boundary when the shading is painted, in addition to the current clipping path and any other clipping boundaries in effect at that time."
      ],
      [
        "AntiAlias",
        "boolean",
        "(Optional) A flag indicating whether to filter the shading function to prevent aliasing artifacts.\nNOTE The shading operators sample shading functions at a rate determined by the resolution of the output device. Aliasing can occur if the function is not smooth—that is, if it has a high spatial frequency relative to the sampling rate. Anti-aliasing can be computationally expensive and is usually unnecessary, since most shading functions are smooth enough or are sampled at a high enough frequency to avoid aliasing effects. Anti-aliasing may not be implemented on some output devices, in which case this flag is ignored.\nDefault value: false."
      ]
    ]
  }
}
